app/views/users/_form.html.erb

SELECT "roles".* FROM "roles" WHERE "roles"."organization_id" = ?  [["organization_id", 1]]
---
    <%= form.label :role %>
    <%= form.select :role, organization.roles.collect { |role| [role.name, role.id]}, class: "form-control"%>