app/views/tables/show.html.erb

<ul class="list-group">
<% @table.orders.each do |o| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."table_id" = ?  [["table_id", 1]]