app/views/dishes/_form.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."organization_id" = ?  [["organization_id", 1]]
---
        <%= form.label :category %>
        <%= form.select :category_id, organization.categories.collect { |category| [category.name, category.id]}, class: "form-control" %>

SELECT "ingridients".* FROM "ingridients" WHERE "ingridients"."organization_id" = ?  [["organization_id", 1]]
---
    <ul class="list-group form-group">
    <% organization.ingridients.each do |i|%>