app/views/dishes/show.html.erb

<ul class="list-group card-text">
    <% @dish.ingridients.each do |i| %>
---
SELECT "ingridients".* FROM "ingridients" INNER JOIN "dishes_ingridients" ON "ingridients"."id" = "dishes_ingridients"."ingridient_id" WHERE "dishes_ingridients"."dish_id" = ?  [["dish_id", 1]]