app/controllers/dishes_controller.rb

  def create
    @dish = organization.dishes.create(permit_params)
---
INSERT INTO "dishes" ("name", "description", "price", "organization_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def set_dish
    @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def collect_ingridients
    params[:dish][:ingridients].collect  do |id|
      organization.ingridients.find(id)
---
SELECT  "ingridients".* FROM "ingridients" WHERE "ingridients"."organization_id" = ? AND "ingridients"."id" = ? LIMIT ?  [["organization_id", 1], ["id", 1], ["LIMIT", 1]]