app/controllers/order_sessions_controller.rb

SELECT  "order_sessions".* FROM "order_sessions" WHERE "order_sessions"."table_id" = ? AND "order_sessions"."open" = ? ORDER BY "order_sessions"."id" ASC LIMIT ?  [["table_id", 1], ["open", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "order_sessions" WHERE "order_sessions"."table_id" = ? AND "order_sessions"."open" = ?  [["table_id", 1], ["open", 1]]
---
  def index
    if table.order_sessions.where(open: true).size == 1
      session = table.order_sessions.where(open: true).first

INSERT INTO "order_sessions" ("organization_id", "table_id", "open", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["organization_id", 1], ["table_id", 1], ["open", 1], ["created_at", "2020-01-07 08:22:34.194996"], ["updated_at", "2020-01-07 08:22:34.194996"]]
---
  def create
    puts params.to_json
    session = OrderSession.new(table: table, organization: organization, open: true)
    if session.save

SELECT  "order_sessions".* FROM "order_sessions" WHERE "order_sessions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_order_session
    OrderSession.find(params[:id])

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = ? ORDER BY "tables"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def table
    Table.where(id: params[:table_id]).first

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."name" = ? ORDER BY "dishes"."id" ASC LIMIT ?  [["name", "ksldfjladkjöslfkjdflödsfkdlfdöslfasdjkf"], ["LIMIT", 1]]
INSERT INTO "orders" ("dish_id", "order_session_id", "organization_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["dish_id", 1], ["order_session_id", 1], ["organization_id", 1], ["created_at", "2019-12-20 10:01:46.706993"], ["updated_at", "2019-12-20 10:01:46.706993"]]
---
  def create_orders
    params[:order_session].each do |product, quantity|
      quantity.to_i.times do
        order = Order.new(dish: Dish.where(name: product).first, organization: organization, order_session: set_order_session)
        unless order.save