app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "orders" SET "paid" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["paid", 1], ["updated_at", "2019-07-12 17:36:10.338657"], ["id", 14]]
---
  def pay
    order = Order.find(params[:id])
    order.paid = true
    order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
UPDATE "orders" SET "paid" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["paid", 1], ["updated_at", "2019-07-15 18:54:58.823746"], ["id", 26]]
---
  def pay_group
    params[:orders].each do |p|
      order = Order.find(p)
      unless order.nil?
        order.paid = true
        order.save