app/controllers/products_controller.rb

INSERT INTO "products" ("name", "organization_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "My Product"], ["organization_id", 1], ["created_at", "2019-08-12 15:55:06.645854"], ["updated_at", "2019-08-12 15:55:06.645854"]]
---
  def create
    product = Product.new(permit_product)
    params[:product][:ingridients].each do |name, value|
      product.ingridients << Ingridient.where(name: name).first if value == 1