app/controllers/tables_controller.rb

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_table
      @table = Table.find(params[:id])