app/controllers/tables_controller.rb

SELECT "tables".* FROM "tables"
---
  def index
    @tables = Table.all

SELECT "products".* FROM "products"
---
  def edit
    @products = Product.all

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("table_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["table_id", 1], ["product_id", 1], ["created_at", "2019-07-12 17:56:07.906510"], ["updated_at", "2019-07-12 17:56:07.906510"]]
SELECT  "products".* FROM "products" WHERE "products"."name" = ? LIMIT ?  [["name", "Burger"], ["LIMIT", 1]]
---
  def update
    @orders = orders
    table = @orders[:tisch]
    @orders.delete(:tisch)
    @drinks = []
    @food = []
    @orders.each do |o|
      o[1].to_i.times do
        order = Order.new
        Table.find(table).orders << order
        Product.find_by(name: o[0].to_s).orders << order
        product = Product.find_by(name: o[0].to_s)
        if product.food
          @food << product
        else
          @drinks << product
        end
        order.save
      end
    end
    redirect_to Table.find(table), notice: 'Bestellung aufgenommen'

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = ? AND "tables"."organization_id" = ? ORDER BY "tables"."id" ASC LIMIT ?  [["id", 1], ["organization_id", 1], ["LIMIT", 1]]
---
  def set_table
    @table = Table.where(
      id: params[:id],
      organization_id: organization.id
    ).first