app/controllers/tables_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."order_session_id" = ?  [["order_session_id", 1]]
SELECT "order_sessions".* FROM "order_sessions" WHERE "order_sessions"."table_id" = ?  [["table_id", 1]]
---
  def show
    @session = @table.order_sessions.select { |s| s.open?}.first