app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    current_user.organization.roles.find(params[:user][:role]).users << @user
    current_user.organization.users << @user
---
INSERT INTO "users" ("username", "email", "password_digest", "organization_id", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."organization_id" = ? AND "roles"."id" = ? ORDER BY "roles"."id" ASC LIMIT ?  [["organization_id", 1], ["id", 0], ["LIMIT", 1]]

  def destroy
    log_out_user
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

  def set_user
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]