app/views/organizations/show.html.erb

                <ul class="list-group card-text">
                <% @organization.roles.each do |role| %>
                    <li class="list-group-item"><%= link_to role.name, role %>: <%= role.users.size %></li>
---
SELECT "roles".* FROM "roles" WHERE "roles"."organization_id" = ?  [["organization_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."organization_id" = ?  [["organization_id", 1]]
SELECT COUNT(*) FROM "users" WHERE "users"."role_id" = ?  [["role_id", 1]]

                <ul class="list-group card-text">
                    <% @organization.tables.each do |t| %>
---
SELECT "tables".* FROM "tables" WHERE "tables"."organization_id" = ?  [["organization_id", 1]]

                <ul class="list-group card-text">
                    <% @organization.drinks.each do |p|%>
---
SELECT "drinks".* FROM "drinks" WHERE "drinks"."organization_id" = ?  [["organization_id", 1]]

                    <% end %>
                    <% @organization.dishes.each do |p| %>
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."organization_id" = ?  [["organization_id", 1]]