app/views/products/_form.html.erb

SELECT "ingridients".* FROM "ingridients"
---
    <ul class="list-group" style="overflow: scroll; height: 30vh">
        <% organization.ingridients.each do |i|%>